import { HomeGrid } from "@/components/HomeGrid";

export default function Products() {
  const items = [
    {
      title: "Зернові",
      categories: ["Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас"],
      img: "/photo/test.jpg",
    },
    {
      title: "Овочі",
      categories: ["Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас"],
      img: "/photo/test.jpg",
    },
    {
      title: "Овочі",
      categories: ["Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас"],
      img: "/photo/test.jpg",
    },
    {
      title: "Овочі",
      categories: ["Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас", "Пшениця 1 клас"],
      img: "/photo/test.jpg",
    }
  ];
  return (
    <>
      <main className="flex flex-col justify-center items-center w-full p-5 bg-white">
        <div className="flex flex-col">
        <h1 className="text-5xl font-bold mb-5">Продукція</h1>
        <HomeGrid products={items}/>
        </div>
        <div className="flex flex-col">
        <h1 className="text-5xl font-bold my-5">Послуги</h1>
        <HomeGrid products={items}/>
        </div>
      </main>
    </>
  )
}